; domain
(define (domain logistics-strips)
  (:requirements :strips) 
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city)
        (dummy-goal)
        (dummy-fact)
)
(:functions (total-cost))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (dummy-fact)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) (dummy-fact)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc) (dummy-fact)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc) (dummy-fact)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from) (dummy-fact)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to) (dummy-fact)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))

(:action pref-op0
  :precondition (and (dummy-fact))
  :effect (and (not (dummy-fact)) (dummy-goal) (increase (total-cost) 100)))

(:action pref-op1
:precondition (and (dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(airport l20) 
(at a0 l00)
(at a1 l00)
(at p0 l00)
(at p1 l01)
(at t0 l01)
(at t1 l10)
(at t2 l20)
(city c0) 
(city c1) 
(city c2) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(in-city l20 c2) 
(in-city l21 c2) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(location l20) 
(location l21) 
(obj p0) 
(obj p1) 
(truck t0) 
(truck t1) 
(truck t2) 
)
:effect (and (not (dummy-fact)) (dummy-goal)))

)

; problem
(define (problem logistics-c3-s2-p2-a2)
(:domain logistics-strips)
(:objects a0 a1 
          c0 c1 c2 
          t0 t1 t2 
          l00 l01 l10 l11 l20 l21 
          p0 p1 
)
(:INIT (= (total-cost) 0)
	(dummy-fact)
(airplane a0) 
(airplane a1) 
(airport l00) 
(airport l10) 
(airport l20) 
(at a0 l00)
(at a1 l20)
(at p0 l20)
(at p1 l21)
(at t0 l00)
(at t1 l10)
(at t2 l21)
(city c0) 
(city c1) 
(city c2) 
(in-city l00 c0) 
(in-city l01 c0) 
(in-city l10 c1) 
(in-city l11 c1) 
(in-city l20 c2) 
(in-city l21 c2) 
(location l00) 
(location l01) 
(location l10) 
(location l11) 
(location l20) 
(location l21) 
(obj p0) 
(obj p1) 
(truck t0) 
(truck t1) 
(truck t2) 
)
(:goal (and
(dummy-goal)
(at p1 l01)
))
(:metric minimize (total-cost))
)

; plan
1. (load-truck p1 t2 l21)
   deleted: (at p1 l21)
   added: (in p1 t2)
   goals met: 0 of 2
2. (drive-truck t2 l21 l20 c2)
   deleted: (at t2 l21)
   added: (at t2 l20)
   goals met: 0 of 2
3. (unload-truck p1 t2 l20)
   deleted: (in p1 t2)
   added: (at p1 l20)
   goals met: 0 of 2
4. (load-airplane p1 a1 l20)
   deleted: (at p1 l20)
   added: (in p1 a1)
   goals met: 0 of 2
5. (fly-airplane a1 l20 l00)
   deleted: (at a1 l20)
   added: (at a1 l00)
   goals met: 0 of 2
6. (unload-airplane p1 a1 l00)
   deleted: (in p1 a1)
   added: (at p1 l00)
   goals met: 0 of 2
7. (load-truck p1 t0 l00)
   deleted: (at p1 l00)
   added: (in p1 t0)
   goals met: 0 of 2
8. (drive-truck t0 l00 l01 c0)
   deleted: (at t0 l00)
   added: (at t0 l01)
   goals met: 0 of 2
9. (unload-truck p1 t0 l01)
   deleted: (in p1 t0)
   added: (at p1 l01)
   goals met: 1 of 2
10. (pref-op0)
   deleted: (dummy-fact)
   added: (dummy-goal)
   goals met: 2 of 2
